"""
Для упрощения разработки, этот файл временно имитирует БД и модели
здесь приведена лишь небольшая ключевая часть асортимента для отладки программы
в целях соблюдения коммерческой тайны, цены изменены на выдуманные
!!! -> СВЕРХВАЖНО! КАТЕГОРИИ ЭКРАНОВ И МОДУЛЕЙ, ДОЛЖНЫ ОТЛИЧАТЬСЯ ТОЛЬКО 1 СЛОВОМ MODUL И SCREEN, УЧЕСТЬ ЭТО ПРИ ПОСТРОЕНИИ МОДЕЛИ!! <- !!!
!!! -> ПАРАМЕТР LENS У УГЛОВЫХ ЭКРАНОВ И У МОДУЛЕЙ ДОЛЖЕН СТРОГО СОВПАДАТЬ <- !!!
!!! -> НИ КАКИХ ПРОБЕЛОВ ПЕРЕД И ПОСЛЕ СТРОКИ, ВСЁ СТРИПАТЬ ПРИ ДОБАВЛЕНИИ В МОДЕЛЬ <-!!!
"""

test_moduls = [ # временная имитация базы данных
    
    # ===================================== СТОЛЫ МОДУЛЬНЫЕ ===============================================================
    # ОДИНОЧНЫЕ СТОЛЫ:
    {"art": "ФЛ-1001", "name": "стол для диспетчера 80х100х76 см, RAL7047", "price": 100, "category": "modul_single",
     "url_image": "https://www.unitex.ru/images/dispetch/stoly/ФЛ-1001.jpg", "lens":80, "for_select":"ФЛ-1001 стол для диспетчера 80х100х76 см, RAL7047"},

    {"art": "ФЛ-1002", "name": "стол для диспетчера 100х100х76 см, RAL7047", "price": 0, "category": "modul_single",
     "url_image": "https://www.unitex.ru/images/dispetch/stoly/ФЛ-1002.jpg", "lens":100, "for_select":"ФЛ-1002 стол для диспетчера 100х100х76 см, RAL7047"},

    {"art": "ФЛ-1003", "name": "стол для диспетчера 120х100х76 см, RAL7047", "price": 0, "category": "modul_single",
     "url_image": "https://www.unitex.ru/images/dispetch/stoly/ФЛ-1003.jpg", "lens":120, "for_select":"ФЛ-1003 стол для диспетчера 120х100х76 см, RAL7047"},


    # СТОЛ ЛЕВЫЙ:
    {"art": "ФЛ-1101", "name": "Модуль стола для диспетчера левый 60х100х76 см, RAL7047", "price": 20, "category": "modul_left",
     "url_image": "https://www.unitex.ru/images/dispetch/stoly/ФЛ-1101-ФЛ-1102-л.jpg", "lens":60},


    # СТОЛ ПРАВЫЙ:
    {"art": "ФЛ-1102", "name": "Модуль стола для диспетчера правый 60х100х76 см, RAL7047", "price": 0, "category": "modul_right",
    "url_image": "https://www.unitex.ru/images/dispetch/stoly/%D0%A4%D0%9B-1101-%D0%A4%D0%9B-1102-%D0%BF.jpg", "lens":60},


    # СТОЛ ПРОМЕЖУТОЧНЫЙ: // В ПРАЙСЕ НЕ УКАЗАНО СЛОВО ПРОМЕЖУТОЧНЫЙ, НУЖНО ДОБАВЛЯТЬ ПРОГРАММНО В МОДУЛЕ PRICE
    {"art": "ФЛ-1151", "name": "Модуль стола для диспетчера промежуточный 100х100х76 см, RAL7047", "price": 0, "category": "modul_center",
    "url_image": "https://www.unitex.ru/images/dispetch/stoly/%D0%A4%D0%9B-1151.jpg", "lens":100},


    # МОДУЛЬ УГЛОВОЙ 90
    {"art": "ФЛ-1170", "name": "Модуль стола угловой 90° 100х100х76 см, RAL7047", "price": 0, "category": "modul_angle_90",
    "url_image": "https://www.unitex.ru/images/dispetch/stoly/%D0%A4%D0%9B-1170.jpg", "lens":100},


    # МОДУЛЬ УГЛОВОЙ ЛЕВЫЙ 22
    {"art": "ФЛ-1141", "name": "Модуль стола угловой 22,5° левый 120х100х76 см, RAL7047", "price": 0, "category": "modul_22_left",
    "url_image": "https://www.unitex.ru/images/dispetch/stoly/ФЛ-1141-ФЛ-1142-угловой-22,5-л.jpg", "lens":120},


    # МОДУЛЬ УГЛОВОЙ ПРАВЫЙ 22
    {"art": "ФЛ-1142", "name": "Модуль стола угловой 22,5° правый 120х100х76 см, RAL7047", "price": 0, "category": "modul_22_right",
    "url_image": "https://www.unitex.ru/images/dispetch/stoly/ФЛ-1141-ФЛ-1142-угловой-22,5-п.jpg", "lens":120},


    # МОДУЛЬ УГЛОВОЙ ЦЕНТРАЛЬНЫЙ 22
    {"art": "ФЛ-1171", "name": "Модуль стола угловой 22,5° 100х100х76 см, RAL7047", "price": 0, "category": "modul_22_center",
    "url_image": "https://www.unitex.ru/images/dispetch/stoly/ФЛ-1171.jpg", "lens":100},


    # ===================================== ЭКРАНЫ НАСТОЛЬНЫЕ ===============================================================


    # ОТДЕЛЬНОСТОЯЩИЕ СТОЛЫ:

    # ЭКРАН НАСТОЛЬНЫЙ СТОЛА 80 -> 45
    {"art": "ФЛ-1501.45", "name": "Экран настольный стола 80 h=45 см, RAL7047", "price": 4, "category": "screen_single_45",
    "url_image": "", "lens":80},

    # ЭКРАН НАСТОЛЬНЫЙ СТОЛА 80 -> 85
    {"art": "ФЛ-1501.85", "name": "Экран настольный стола 80 h=85 см, RAL7047", "price": 1, "category": "screen_single_85",
    "url_image": "", "lens":80},


    # ЭКРАН НАСТОЛЬНЫЙ СТОЛА 100 -> 45
    {"art": "ФЛ-1502.45", "name": "Экран настольный стола 100 h=45 см, RAL7047", "price": 12, "category": "screen_single_45",
    "url_image": "", "lens":100},

    # ЭКРАН НАСТОЛЬНЫЙ СТОЛА 100 -> 85
    {"art": "ФЛ-1502.85", "name": "Экран настольный стола 100 h=85 см, RAL7047", "price": 11, "category": "screen_single_85",
    "url_image": "", "lens":100},

    # ЭКРАН НАСТОЛЬНЫЙ СТОЛА 120 -> 45
    {"art": "ФЛ-1503.45", "name": "Экран настольный стола 120 h=45 см, RAL7047", "price": 100, "category": "screen_single_45",
    "url_image": "", "lens":120},

    # ЭКРАН НАСТОЛЬНЫЙ СТОЛА 120 -> 85
    {"art": "ФЛ-1503.85", "name": "Экран настольный стола 120 h=85 см, RAL7047", "price": 8, "category": "screen_single_85",
    "url_image": "", "lens":120},

    # МОДУЛИ ЛЕВОСТОРОННИЕ

    # ЭКРАН НАСТОЛЬНЫЙ СТОЛА 60 ЛЕВЫЙ -> 45
    {"art": "ФЛ-1601.45", "name": "Экран настольный левый модуля 60 h=45 см, RAL7047", "price": 7, "category": "screen_left_45",
    "url_image": "", "lens":60},

    # ЭКРАН НАСТОЛЬНЫЙ СТОЛА 60 ЛЕВЫЙ -> 85
    {"art": "ФЛ-1601.85", "name": "Экран настольный левый модуля 60 h=85 см, RAL7047", "price": 12, "category": "screen_left_85",
    "url_image": "", "lens":60},

    # МОДУЛИ ПРАВОСТОРОННИЕ

    # ЭКРАН НАСТОЛЬНЫЙ СТОЛА 60 ПРАВЫЙ -> 45
    {"art": "ФЛ-1602.45", "name": "Экран настольный правый модуля 60 h=45 см, RAL7047", "price": 4, "category": "screen_right_45",
    "url_image": "", "lens":60},
    
    # ЭКРАН НАСТОЛЬНЫЙ СТОЛА 60 ПРАВЫЙ -> 85
    {"art": "ФЛ-1602.85", "name": "Экран настольный правый модуля 60 h=85 см, RAL7047", "price": 3, "category": "screen_right_85",
    "url_image": "", "lens":60},

    # ЭКРАН НАСТОЛЬНЫЙ СТОЛА ПРОМЕЖУТОЧНОГО -> 45
    {"art": "ФЛ-1651.45", "name": "Экран настольный модуля 100 h=45 см, RAL7047", "price": 100, "category": "screen_center_45",
    "url_image": "", "lens":100},
    
    # ЭКРАН НАСТОЛЬНЫЙ СТОЛА ПРОМЕЖУТОЧНОГО -> 85
    {"art": "ФЛ-1651.85", "name": "Экран настольный модуля 100 h=85 см, RAL7047", "price": 2, "category": "screen_center_85",
    "url_image": "", "lens":100},



     # ЭКРАН НАСТОЛЬНЫЙ МОДУЛЯ УГЛОВОГО НА 90 ГРАДУСОВ
    {"art": "ФЛ-1670.45", "name": "Экран настольный модуля h=45 см, RAL7047", "price": 0, "category": "screen_angle_90_45",
    "url_image": "", "lens":100},

    {"art": "ФЛ-1670.85", "name": "Экран настольный модуля h=85 см, RAL7047", "price": 0, "category": "screen_angle_90_85",
    "url_image": "", "lens":100},


    # УГЛОВЫЕ МОДУЛИ НА 22 ГРАДУСА

    # ЭКРАН НАСТОЛЬНЫЙ МОДУЛЯ УГЛОВОГО ЦЕНТРАЛЬНОГО НА 22 ГРАДУСА ВЫСОТОЙ 45
    {"art": "ФЛ-1671.45", "name": "Экран настольный модуля 22,5° h=45 см, RAL7047", "price": 0, "category": "screen_22_center_45",
    "url_image": "", "lens":100},

    # ЭКРАН НАСТОЛЬНЫЙ МОДУЛЯ УГЛОВОГО ЦЕНТРАЛЬНОГО НА 22 ГРАДУСА ВЫСОТОЙ 85
    {"art": "ФЛ-1671.85", "name": "Экран настольный модуля 22,5° h=85 см, RAL7047", "price": 0, "category": "screen_22_center_85",
    "url_image": "", "lens":100},



    # ЭКРАН НАСТОЛЬНЫЙ МОДУЛЯ УГЛОВОГО ЛЕВОГО НА 22 ГРАДУСА ВЫСОТОЙ 45
    {"art": "ФЛ-1641.45", "name": "Экран настольный левый модуля 120 h=45 см, RAL7047", "price": 0, "category": "screen_22_left_45",
    "url_image": "", "lens":120},

    # ЭКРАН НАСТОЛЬНЫЙ МОДУЛЯ УГЛОВОГО ЛЕВОГО НА 22 ГРАДУСА ВЫСОТОЙ 85
    {"art": "ФЛ-1641.85", "name": "Экран настольный левый модуля 120 h=85 см, RAL7047", "price": 0, "category": "screen_22_left_85",
    "url_image": "", "lens":120},




    # ЭКРАН НАСТОЛЬНЫЙ МОДУЛЯ УГЛОВОГО ПРАВОГО НА 22 ГРАДУСА ВЫСОТОЙ 45
    {"art": "ФЛ-1642.45", "name": "Экран настольный правый модуля 120 h=45 см, RAL7047", "price": 0, "category": "screen_22_right_45",
    "url_image": "", "lens":120},


    # ЭКРАН НАСТОЛЬНЫЙ МОДУЛЯ УГЛОВОГО ПРАВОГО НА 22 ГРАДУСА ВЫСОТОЙ 85
    {"art": "ФЛ-1642.85", "name": "Экран настольный правый модуля 120 h=85 см, RAL7047", "price": 0, "category": "screen_22_right_85",
    "url_image": "", "lens":120},





    # ==================================== СТОЙКИ ДЛЯ ЭКРАНА ===================================================

    # СТОЙКА ЭКРАНА 45
    {"art": "ФЛ-1711.45", "name": "Стойка экрана h=45 см промежуточная 5х5х45, RAL7047", "price": 0, "category": "screen_holder_45",
    "url_image": "", "lens":45},

    # СТОЙКА ЭКРАНА 85
    {"art": "ФЛ-1711.85", "name": "Стойка экрана h=85 см промежуточная 5х5х85, RAL7047", "price": 0, "category": "screen_holder_85",
    "url_image": "", "lens":85},

    # ===================================== ШИНЫ МОНТАЖНЫЕ =====================================================

    # ШИНА МОНТАЖНАЯ L=50
    {"art": "ФЛ-1901", "name": "Шина монтажная L=50 см ", "price": 3, "category": "schine_montage",
    "url_image": "", "lens":50},

    # ШИНА МОНТАЖНАЯ L=60
    {"art": "ФЛ-1902", "name": "Шина монтажная L=60 см ", "price": 0, "category": "schine_montage",
    "url_image": "", "lens":60},

    # ШИНА МОНТАЖНАЯ L=80
    {"art": "ФЛ-1904", "name": "Шина монтажная L=80 см ", "price": 0, "category": "schine_montage",
    "url_image": "", "lens":80},

    # ШИНА МОНТАЖНАЯ L=97
    {"art": "ФЛ-1919", "name": "Шина монтажная L=97 см ", "price": 0, "category": "schine_montage",
    "url_image": "", "lens":97},

    # ШИНА МОНТАЖНАЯ L=100
    {"art": "ФЛ-1906", "name": "Шина монтажная L=100 см ", "price": 100, "category": "schine_montage",
    "url_image": "", "lens":100},




    # ==================================== ОПЦИОНАЛЬНЫЕ КОМПЛЕКТУЮЩИЕ ==========================================

    # СТОЙКА ДЛЯ ЭКРАНА НИЗКАЯ 45
    {"art": "ФЛ-1711.45", "name": "Стойка экрана h=45 см промежуточная 5х5х45, RAL7047 ", "price": 0, "category": "option",
    "url_image": "", "lens":45},
    

    # СТОЙКА ДЛЯ ЭКРАНА ВЫСОКАЯ 85
    {"art": "ФЛ-1711.85", "name": "Стойка экрана h=85 см промежуточная 5х5х85, RAL7047 ", "price": 0, "category": "option",
    "url_image": "", "lens":85},


    # КРОНШТЕЙН ДЛЯ МОНИТОРОВ ФЛ-1721
    {"art": "ФЛ-1721", "name": "Кронштейн под монитор", "price": 100, "category": "option",
    "url_image": "https://www.unitex.ru/images/dispetch/aksessuary/%D0%BA%D1%80%D0%BE%D0%BD%D1%88%D1%82%D0%B5%D0%B9%D0%BD__.jpg", "lens":0},

    # СТОЙКА ДЛЯ КРОНШТЕЙНА ДЛЯ МОНИТОРА НИЗКАЯ 45
    {"art": "ФЛ-1715.45", "name": "Стойка кронштейна под монитор h=36 см 3,2х3,2х36, RAL7047 ", "price": 0, "category": "option",
    "url_image": "https://www.unitex.ru/images/dispetch/aksessuary/%D0%A4%D0%9B-1715,45.jpg", "lens":45},

    # СТОЙКА ДЛЯ КРОНШТЕЙНА ДЛЯ МОНИТОРА ВЫСОКАЯ 85
    {"art": "ФЛ-1715.85", "name": "Стойка кронштейна под монитор h=76 см 3,2х3,2х76, RAL7047 ", "price": 0, "category": "option",
    "url_image": "https://www.unitex.ru/images/dispetch/aksessuary/%D0%A4%D0%9B-1715,85.jpg", "lens":85},
    
    # БЛОК РОЗЕТОК
    {"art": "ФЛ-1731", "name": "Блок розеток 9х220V", "price": 0, "category": "option",
    "url_image": "", "lens":0},

    # БЛОК RJ 45
    {"art": "ФЛ-1732", "name": "Панель коммутационная 245хRJ45", "price": 5000, "category": "option",
    "url_image": "", "lens":0},

    # БЛОК ШИНА ЗАЗЕМЛЕНИЯ
    {"art": "ФЛ-1733", "name": "Шина заземления медная 48,5(19´´)х2х0,4", "price": 0, "category": "option",
    "url_image": "", "lens":0},


    # ОПОРА ПРОМЕЖУТОЧНАЯ
    {"art": "ФЛ-1701", "name": "Опора модуля промежуточная 86,5х5х72,8, RAL7047", "price": 0, "category": "option",
    "url_image": "", "lens":0},


]





def get_simple_modul():
    return [row for row in test_moduls if "simple_modul" == row["category"]]